.config/doom/config.org
** Code folding
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el :results none
 (defhydra hydra:folding (:color red)
   "
  _o_pen node    _n_ext fold       toggle _f_orward  _s_how current only
  _c_lose node   _p_revious fold   toggle _a_ll
  "
   ("o" origami-open-node)
   ("c" origami-close-node)
   ("n" origami-next-fold)
   ("p" origami-previous-fold)
   ("f" origami-forward-toggle-node)
   ("a" origami-toggle-all-nodes)
   ("s" origami-show-only-node))
#+end_src


** Keybinds
#+begin_src emacs-lisp :tangle yes
(map!
 :leader
 :prefix "H"
(:desc "Themes"
       :nvm "t" #'hydra:themes/body)
(:desc "Windows"
       :nvm "w" #'hydra:windows/body)
(:desc "Dired"
       :nvm "d" #'hydra:dired/body)
(:desc "FlyCheck"
       :nvm "f" #'hydra:flycheck/body)
(:desc "Org"
       :nvm "o" #'hydra:org/body)
(:desc "Avy"
       :nvm "a" #'hydra:yasnippet/body)
(:desc "Folding"
       :nvm "z" #'hydra:folding/body)
(:desc "LSP"
       :nvm "l" #'hydra:lsp/body)
(:desc "Buffers"
       :nvm "b" #'hydra:buffers/body)
(:desc "DAP"
       :nvm "D" #'hydra-dap))
#+end_src

#+RESULTS:
: hydra-dap/body
