.config/doom/config.el
       :nvm "t" #'hydra:themes/body)
(:desc "Windows"
       :nvm "w" #'hydra:windows/body)
(:desc "Dired"
       :nvm "d" #'hydra:dired/body)
(:desc "FlyCheck"
       :nvm "f" #'hydra:flycheck/body)
(:desc "Org"
       :nvm "o" #'hydra:org/body)
(:desc "Avy"
       :nvm "a" #'hydra:yasnippet/body)
(:desc "Folding"
       :nvm "z" #'hydra:folding/body)
(:desc "LSP"
       :nvm "l" #'hydra:lsp/body)
(:desc "Buffers"
       :nvm "b" #'hydra:buffers/body)
(:desc "DAP"
       :nvm "D" #'hydra-dap))
